Berikut adalah Demo Application Program Interface (API)  untuk mengakses database webserver

In [5]:
# Impor Library yang diperlukan
import requests
import pandas as pd
import gunicorn

database SQL dengan nama chinook.db disimpan di localhost (127.0.0.1) pada folder data dengan method GET
API yang digunakan adalah "/data/get/database_name"
database name dapat diisi dengan "chinook.db" atau user dapat memilih database lain jika dalam webserver terdapat lebih dari satu SQL database

# Struktur SQL database Chinook


![](res/database.jpeg)

# 1. Akses Semua Table dalam database chinook

**API yang digunakan /data/get/chinook.db**

![](res/pic1.png)

In [3]:
url1 = 'http://localhost:5000/data/get/chinook.db'
r1 = requests.get(url1)
r_pd1 = pd.DataFrame(r1.json())
r_pd1

              name
0           albums
1          artists
10          tracks
2        customers
3        employees
4           genres
5         invoices
6    invoice_items
7      media_types
8        playlists
9   playlist_track

# 2 Akses data pada table yang dipilih

**API yang digunakan /data/get/chinook.db/-table-**

API : /data/get/chinook.db/invoices

**Source Code dalam app.py**

![](res/pic2.png)

In [4]:
url2 = 'http://localhost:5000/data/get/chinook.db/invoices'
r2 = requests.get(url2)
r_pd2 = pd.DataFrame(r2.json())
r_pd2

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,2,2009-01-01 00:00:00,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,1.98
1,2,4,2009-01-02 00:00:00,Ullevålsveien 14,Oslo,None,Norway,0171,3.96
2,3,8,2009-01-03 00:00:00,Grétrystraat 63,Brussels,None,Belgium,1000,5.94
3,4,14,2009-01-06 00:00:00,8210 111 ST NW,Edmonton,AB,Canada,T6G 2C7,8.91
4,5,23,2009-01-11 00:00:00,69 Salem Street,Boston,MA,USA,2113,13.86
...,...,...,...,...,...,...,...,...,...
407,408,25,2013-12-05 00:00:00,319 N. Frances Street,Madison,WI,USA,53703,3.96
408,409,29,2013-12-06 00:00:00,796 Dundas Street West,Toronto,ON,Canada,M6J 1V1,5.94
409,410,35,2013-12-09 00:00:00,"Rua dos Campeões Europeus de Viena, 4350",Porto,None,Portugal,None,8.91
410,411,44,2013-12-14 00:00:00,Porthaninkatu 9,Helsinki,None,Finland,00530,13.86
411,412,58,2013-12-22 00:00:00,"12,Community Centre",Delhi,None,India,110017,1.99

Table diatas adalah hasil dari API dengan query pada table "Invoices"

# 3. Akses data pada table pada spesifik kolom

**API yang digunakan /data/get/chinook.db/-table-/-column-**

API : /data/get/chinook.db/customers/firstname

In [6]:
url3 = 'http://localhost:5000/data/get/chinook.db/invoices/BillingCountry'
r3 = requests.get(url3)
r_pd3 = pd.DataFrame(r3.json())
r_pd3

     BillingCountry
0           Germany
1            Norway
10   United Kingdom
100         Denmark
101          Canada
..              ...
95          Hungary
96            India
97           Brazil
98           Canada
99   Czech Republic

[412 rows x 1 columns]

Table diatas adalah hasil dari API dengan query pada table **"Invoices"** kolom **"BillingCountry"**

# 4. menggabungkan 2 table (Invoices & Customers)

**API yang digunakan /data/get/chinook.db/-table1-/-table2-/-key-**

berikut adalah API untuk menggabungkan 2 table (table **Invoices** dan table **Customers**) menngunakan SQL QUERY LEFT JOIN

**Source Code dalam app.py**

![](res/pic3.png)

In [457]:
url4 = 'http://localhost:5000/data/get/chinook.db/Invoices/Customers/CustomerId'
r4 = requests.get(url4)
r_pd4 = pd.DataFrame(r4.json())
r_pd4.head(10)

   FirstName    LastName       City                  Address  Total
0     Leonie      Köhler  Stuttgart  Theodor-Heuss-Straße 34   1.98
1      Bjørn      Hansen       Oslo         Ullevålsveien 14   3.96
2       Daan     Peeters   Brussels          Grétrystraat 63   5.94
3       Mark     Philips   Edmonton           8210 111 ST NW   8.91
4       John      Gordon     Boston          69 Salem Street  13.86
5       Fynn  Zimmermann  Frankfurt         Berger Straße 10   0.99
6     Niklas    Schröder     Berlin      Barbarossastraße 19   1.98
7  Dominique    Lefebvre      Paris           8, Rue Hanovre   1.98
8      Wyatt      Girard   Bordeaux   9, Place Louis Barthou   3.96
9       Hugh    O'Reilly     Dublin         3 Chatham Street   5.94

# 5. Contoh 1 : API menggabungkan 2 table (Invoices & Customers) dan menampilkannya dalam kolom secara specific

**API yang digunakan /data/get/chinook.db/-table1-/-table2-/-key-/-column1-/column2-**

Uji Coba Skeleton SQL Query yang akan dijalankan ke dalam pada app.py

In [461]:
table1 = "Invoices"
table2 = "Customers"
key    = "CustomerId"
column1 = "FirstName"
column2 = "Total"
#sql_command = "SELECT "+table1+"."+column+" FROM " +table1+ " LEFT JOIN "+table2+" ON "+table1+"."+key+"="+table2+"."+key
sql_command = "SELECT "+table1+"."+column1+","+table1+"."+column2+" FROM " +table1+ " LEFT JOIN "+table2+" ON "+table1+"."+key+"="+table2+"."+key
sql_command = str(sql_command)
sql_command

'SELECT Invoices.FirstName,Invoices.Total FROM Invoices LEFT JOIN Customers ON Invoices.CustomerId=Customers.CustomerId'

**Source Code dalam app.py**

![](res/pic4.png)

In [7]:
url5 = 'http://localhost:5000/data/get/chinook.db/Invoices/Customers/CustomerId/BillingAddress/Firstname'
r5 = requests.get(url5)
r_pd5 = pd.DataFrame(r5.json())
r_pd5.head()

            BillingAddress FirstName
0  Theodor-Heuss-Straße 34    Leonie
1         Ullevålsveien 14     Bjørn
2          Grétrystraat 63      Daan
3           8210 111 ST NW      Mark
4          69 Salem Street      John

# 6. Contoh 2 : API untuk mendapatkan kolom Total dan kolom Country

In [ ]:
**API yang digunakan /data/get/chinook.db/-table1-/-table2-/-key-/-column1-/column2-**

In [469]:
url6 = 'http://localhost:5000/data/get/chinook.db/invoices/customers/CustomerId/Total/Country'
r6 = requests.get(url6)
r_pd6 = pd.DataFrame(r6.json())
r_pd6

     Total   Country
0     1.98   Germany
1     3.96    Norway
2     5.94   Belgium
3     8.91    Canada
4    13.86       USA
..     ...       ...
407   3.96       USA
408   5.94    Canada
409   8.91  Portugal
410  13.86   Finland
411   1.99     India

[412 rows x 2 columns]

# 6. API untuk mendapatkan total invoice berdasarkan kolom Country dengan perintah tambahan top5 top10 top15

**API yang digunakan /data/get/chinook.db/-table1-/-table2-/-key-/-column1-/column2-/top5 or top10 or top15**

Uji Coba Skeleton SQL Query didalam app.py

In [11]:
table1 = "invoices"
table2 = "customers"
key    = "CustomerId"
column1 = "Total"
column2 = "Country" 
command = "10"

sql_command = "SELECT "+table1+"."+column1+","+table2+"."+column2+" FROM " \
+table1+ " LEFT JOIN "+table2+" ON "+table1+"."+key+"="+table2+"."+key
sql_command

'SELECT invoices.Total,customers.Country FROM invoices LEFT JOIN customers ON invoices.CustomerId=customers.CustomerId'

**Source Code dalam app.py**

![](res/pic5.png)

In [49]:
url7 = 'http://localhost:5000/data/get/chinook.db/invoices/customers/CustomerId/Total/Country/top5'
r7 = requests.get(url7)
r_pd7 = pd.DataFrame(r7.json())
r_pd7

     Total         Country
403  25.86  Czech Republic
298  23.86             USA
95   21.86         Hungary
193  21.86         Ireland
200  18.86             USA
88   18.86         Austria
87   17.91           Chile
305  16.86  Czech Republic
312  16.86          France
102  15.86             USA
207  15.86          Norway
192  14.91         Germany
116  13.86          France
151  13.86  United Kingdom
291  13.86           Italy

In [50]:
url7 = 'http://localhost:5000/data/get/chinook.db/invoices/customers/CustomerId/Total/Country/top15'
r7 = requests.get(url7)
r_pd7 = pd.DataFrame(r7.json())
r_pd7

     Total         Country
403  25.86  Czech Republic
298  23.86             USA
95   21.86         Hungary
193  21.86         Ireland
200  18.86             USA
88   18.86         Austria
87   17.91           Chile
305  16.86  Czech Republic
312  16.86          France
102  15.86             USA
207  15.86          Norway
192  14.91         Germany
116  13.86          France
151  13.86  United Kingdom
291  13.86           Italy

# Demo semua API yang sudah di deploy di webserver

In [55]:
url1 = 'https://abdinsql.herokuapp.com/data/get/chinook.db'
r = requests.get(url1)
r_pd = pd.DataFrame(r.json())
r_pd.head()

JSONDecodeError: Expecting value: line 1 column 1 (char 0)

In [ ]:
url2 = 'https://abdinsql.herokuapp.com/data/get/chinook.db/invoices'
r = requests.get(url1)
r_pd = pd.DataFrame(r.json())
r_pd.head()

In [ ]:
url3 = 'https://abdinsql.herokuapp.com/data/get/chinook.db/invoices/BillingCountry'
r = requests.get(url1)
r_pd = pd.DataFrame(r.json())
r_pd.head()

In [ ]:
url4 = 'https://abdinsql.herokuapp.com/data/get/chinook.db/Invoices/Customers/CustomerId'
r = requests.get(url1)
r_pd = pd.DataFrame(r.json())
r_pd.head()

In [ ]:
url5 = 'https://abdinsql.herokuapp.com/data/get/chinook.db/Invoices/Customers/CustomerId/BillingAddress/Firstname'
r5 = requests.get(url5)
r_pd5 = pd.DataFrame(r5.json())
r_pd5.head()

In [ ]:
url6 = 'https://abdinsql.herokuapp.com/data/get/chinook.db/invoices/customers/CustomerId/Total/Country'
r6 = requests.get(url6)
r_pd6 = pd.DataFrame(r6.json())
r_pd6

In [ ]:
url7 = 'https://abdinsql.herokuapp.com/data/get/chinook.db/invoices/customers/CustomerId/Total/Country/top5'
r7 = requests.get(url7)
r_pd7 = pd.DataFrame(r7.json())
r_pd7

In [54]:
url7 = 'https://abdinsql.herokuapp.com/data/get/chinook.db/invoices/customers/CustomerId/Total/Country/top15'
r7 = requests.get(url7)
r_pd7 = pd.DataFrame(r7.json())
r_pd7

JSONDecodeError: Expecting value: line 1 column 1 (char 0)